АвтосервисАвтомагазин/src/Catalogs/АС2_АвтомобилиКлиентов/АС2_АвтомобилиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АС2_АвтомобилиКлиентов</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>РегистрационныйЗнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.КА2_Типы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.КА2_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КА2_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.КА2_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузов</name>
    <type>
      <types>CatalogRef.КА2_Кузова</types>
    </type>
  </attributes>
  <attributes>
    <name>Модификация</name>
    <type>
      <types>CatalogRef.КА2_Модификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>CatalogRef.КА2_Комплектации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/АС2_АвтомобилиКлиентов/Forms/ФормаЭлемента/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = Справочники.КА2_Типы.НайтиПоКоду(1);
	КонецЕсли;

	ВыбратьПравуюПанель();

КонецПроцедуры

#КонецОбласти // Обработчики_событий_формы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрационныйЗнакПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
//	Выбор легкового автомобиля
///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ТипПриИзменении(Элемент)

	ВыбратьПравуюПанель();
	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура ПоколениеПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура КузовПриИзменении(Элемент)
	НаименованиеАвтомобиляУстановить();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
//	Выбор прочих ТС
///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Тип1ПриИзменении(Элемент)

	ВыбратьПравуюПанель();
	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура Марка1ПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура Модель1ПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

&НаКлиенте
Процедура Кузов1ПриИзменении(Элемент)

	НаименованиеАвтомобиляУстановить();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервере
Процедура ВыбратьПравуюПанель()

	ЭтоЛегковойАвтомобиль = (Объект.Тип.Код = 1);

	Элементы.ПанельПраваяЛегковые.Видимость = ЭтоЛегковойАвтомобиль;
	Элементы.ПанельПраваяПрочиеТС.Видимость = Не ЭтоЛегковойАвтомобиль;

КонецПроцедуры

&НаСервере
Процедура НаименованиеАвтомобиляУстановить()

	НомернойЗнак = ?(ПустаяСтрока(Объект.РегистрационныйЗнак), "", СтрШаблон(" [%1]", Объект.РегистрационныйЗнак));

	МодельАвтомобиля = "";

	Если ЗначениеЗаполнено(Объект.Кузов) Тогда
		МодельАвтомобиля = Объект.Кузова.Представление;
	ИначеЕсли ЗначениеЗаполнено(Объект.Поколение) Тогда
		МодельАвтомобиля = Объект.Поколение.Представление;
	ИначеЕсли ЗначениеЗаполнено(Объект.Модель) Тогда
		МодельАвтомобиля = Объект.Модель.Представление;
	Иначе
		МодельАвтомобиля = "";
	КонецЕсли;

	Объект.Наименование = МодельАвтомобиля + НомернойЗнак;

КонецПроцедуры

#КонецОбласти
